<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Adobe Flash Player installer, imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.mkuron.munkiserver.FlashPlayer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Install_Adobe_Flash_Player</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.FlashPlayer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>munkiimport_pkgname</key>
				<string>Install Adobe Flash Player.app/Contents/Resources/Adobe Flash Player.pkg</string>
				<key>munkiimport_name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiServerImporter</string>
			<key>pkginfo</key>
			<dict>
				<key>postinstall_script</key>
				<string>#!/bin/bash
/bin/launchctl unload /Library/LaunchDaemons/com.adobe.fpsaud.plist
rm -f /Library/LaunchDaemons/com.adobe.fpsaud.plist</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>