<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>description</key>
	<string>Downloads latest NVIDIA CUDA Driver and imports into MunkiServer.
		This requires jessepeterson's CUDADriverURLProvider.'</string>
	<key>Input</key>
	<dict>
		<key>Identifier</key>
		<string>com.github.mkuron.munkiserver.CUDADriver</string>
		<key>NAME</key>
		<string>CUDADriver</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>CUDADriverURLProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/unpack/root</string>
				<key>pkgdirs</key>
				<dict>
					<key>Library</key>
					<string>0755</string>
					<key>Library/Frameworks</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/CUDAFramework.pkg/Payload</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/root/Library/Frameworks</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/root/Library/Frameworks/CUDA.framework/Versions/A/Resources/Info.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiServerImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>munkiimport_name</key>
				<string>%NAME%</string>
				<key>pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
					<key>postinstall_script</key>
					<string>#!/bin/bash
rm -f /Library/LaunchAgents/com.nvidia.CUDASoftwareUpdate.plist</string>
					<key>installs_plist</key>
					<array>
						<dict>
							<key>CFBundleShortVersionString</key>
							<string>%version%</string>
							<key>path</key>
							<string>/Library/Frameworks/CUDA.framework/Resources/Info.plist</string>
							<key>type</key>
							<string>plist</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>