<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>description</key>
	<string>Downloads latest NVIDIA CUDA Driver and imports into MunkiServer.
		This requires jessepeterson's Recipes from 
		https://github.com/autopkg/jessepeterson-recipes.'</string>
	<key>ParentRecipe</key>
	<string>com.github.jessepeterson.download.CUDADriver</string>
	<key>Input</key>
	<dict>
		<key>Identifier</key>
		<string>com.github.mkuron.munkiserver.CUDADriver</string>
		<key>NAME</key>
		<string>CUDADriver</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiServerImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>munkiimport_name</key>
				<string>%NAME%</string>
				<key>pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
					<key>postinstall_script</key>
					<string>#!/bin/bash
rm -f /Library/LaunchAgents/com.nvidia.CUDASoftwareUpdate.plist</string>
					<key>installs_plist</key>
					<array>
						<dict>
							<key>CFBundleShortVersionString</key>
							<string>%version%</string>
							<key>path</key>
							<string>/Library/Frameworks/CUDA.framework/Resources/Info.plist</string>
							<key>type</key>
							<string>plist</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
