<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uploads GitX into Munki</string>
	<key>Identifier</key>
	<string>com.github.mkuron.munki.GitX</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Application</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/GitX</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>GitX is a graphical client for the git version control system.</string>
			<key>developer</key>
			<string>rowanj</string>
			<key>display_name</key>
			<string>GitX</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.mkuron.download.GitX</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
